package org.example.sem6.cw2;

public class Ex2 {
    /**
     * Продумайте структуру класса Кот. Какие поля и методы будут актуальны для
     * приложения, которое является
     * а) информационной системой ветеринарной клиники
     * б) архивом выставки котов
     * в) информационной системой Театра кошек Ю. Д. Куклачёва
     * Можно записать в текстовом виде, не обязательно реализовывать в java.
     */
    /**
     * а) Поля - ид, имя, пол, порода, владелец, состояние здоровья, возраст
     * б) Поля - ид, имя, пол, порода, владелец, цвет, возраст
     */
}
